In [1]:
import pandas as pd

## 예제 1-10 내부 원소 처리 기준

In [2]:
import numpy as np

In [5]:
# 1~10까지의 임의의 수를 3*3 배열에 생성한다.

In [6]:
np.random.randint(1,10,(3,3))

array([[9, 8, 1],
       [7, 8, 7],
       [9, 5, 4]])

In [7]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'))

In [8]:
df_1

   A  B  C
0  2  9  9
1  6  4  5
2  1  4  9

In [9]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('CAB'))

In [10]:
df_2

   C  A  B
0  8  3  9
1  3  8  5
2  4  4  9

In [ ]:
# 현재의 프레임은 유지되면서 각종 연산함수의 값이 각각의 원소에 업데이트 한다.

In [11]:
np.log(df_2)

          C         A         B
0  2.079442  1.098612  2.197225
1  1.098612  2.079442  1.609438
2  1.386294  1.386294  2.197225

In [16]:
df_2

   C  A  B
0  8  3  9
1  3  8  5
2  4  4  9

In [14]:
# 열을 맞추어 계산한다.

In [12]:
df_1 + df_2

    A   B   C
0   5  18  17
1  14   9   8
2   5  13  13

In [9]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)),columns=list('CB'))

In [10]:
df_3

   C  B
0  3  5
1  1  8
2  5  8

In [ ]:
#df_3는 A열이 없으므로 없는 값(nan)과의 연산으로 A열의 모든 값은 NaN이 된다.

In [11]:
df_1 + df_3

    A   B  C
0 NaN  11  4
1 NaN  13  2
2 NaN  17  8